<!-- 
   ayuda_principal.htm
   ------------------------------------------------------------------------------------------------
   P&aacute;gina de inicio. Se realiza la autenticaci&oacute;n.

   Copyright (c) 10-03-2006 Ra&uacute;l BARAHONA CRESPO (raulbcneo@terra.es)
     Verbatim copying and distribution of this entire document is permitted in 
     any medium, provided this notice is preserved. 
-->

<html>
<head><title></title>
   <link rel="stylesheet" type="text/css" href="../comun/estilo.css">
   <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
   <meta content="Microsoft FrontPage 4.0" name=GENERATOR>
</head>

<body background="../imagenes/logocaliope3_fondo.gif" bgproperties="fixed" >

<table border="0" width="100%" bgcolor="#009900">
  <tr>
    <td width="270"><font color="#FFFFFF" size="6">&nbsp;Ayuda de </font><i><font color="#33CC33" size="6">Cal&iacute;ope</font></i></td>
    <td style="border: 1 solid #FFFFFF">
      <p align="center"><font color="#FFFFFF" size="6">Glosario<br>(<i>modo
      administrador</i>)</font></p>
    </td>
    <td width="100">
      <p align="right"><font color="#33CC33" size="1"><b>&uacute;ltima actualizaci&oacute;n:</b> <br>21 de septiembre de 2010</font></td>
  </tr>
</table>
<p align="center">&nbsp;</p>

<p><font color="#0000FF" size="5"><b>1. ¿Qu&eacute; es el glosario?</b></font></p>

El glosario es una lista o conjunto de t&eacute;rminos inform&aacute;ticos a los cuales se
ha asociado determinada informaci&oacute;n que ser&aacute; detallada en sucesivos apartados.
El glosario est&aacute; &iacute;ntimamente relacionado con el
corpus textual. Adem&aacute;s, cada t&eacute;rmino del glosario tiene asociada una <b>ficha</b> en la que se muestran todos los datos vinculados
al t&eacute;rmino.
<p>&nbsp;</p>
<p><font color="#0000FF" size="5"><b>2. Men&uacute; del glosario y operaciones</b></font></p>
<p>En la parte izquierda de la pantalla aparecen todas las opciones disponibles
para la <b>administraci&oacute;n</b> del glosario: administraci&oacute;n de t&eacute;rminos del
glosario, administraci&oacute;n de relaciones entre t&eacute;rminos y administraci&oacute;n de
tipo de relaciones entre t&eacute;rminos. Tambi&eacute;n aparecen los botones para la b&uacute;squeda de un t&eacute;rmino del glosario: b&uacute;squeda por inicial y b&uacute;squeda
por t&eacute;rmino completo.</p>
<p>En la parte derecha de la pantalla se mostrar&aacute;n los resultados de la b&uacute;squeda
de un t&eacute;rmino del glosario y de la administraci&oacute;n del glosario.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5"><b>3. Operaciones de administraci&oacute;n del
glosario</b></font></p>
<p><font color="#0000FF" size="5">3.1. Administraci&oacute;n de t&eacute;rminos del glosario</font></p>
<p>La pantalla de administraci&oacute;n de t&eacute;rminos del glosario est&aacute; dividida en 2
partes:</p>
<ol>
  <li><b>Nuevo t&eacute;rmino</b> (parte superior de la pantalla). Se introduce en el
    cuadro de texto el nombre del nuevo t&eacute;rmino y se pulsa el bot&oacute;n [ Aceptar
    ].&nbsp;Si el t&eacute;rmino ya existe en el glosario, el sistema muestra por
    pantalla un aviso informando de este hecho. En caso contrario, se procede a
    la b&uacute;squeda del t&eacute;rmino en los textos del corpus para crear los contextos.
    Una vez buscado, aparece una pantalla con los contextos encontrados y con un
    formulario en el que se rellenan todos los datos de la ficha del nuevo
    t&eacute;rmino.<br><br></li>
  <li><b>Modificar/eliminar t&eacute;rmino</b> (parte inferior de la pantalla).
    Aparece un cuadro con todas las letras del alfabeto y el bot&oacute;n [ Todas ].
    Al pulsar sobre una letra aparecen en pantalla todos los t&eacute;rminos del
    corpus que tengan esa letra como inicial. En caso de pulsar [ Todas ], se
    muestran todos los t&eacute;rminos del glosario.&nbsp; Tanto si se pulsa una letra
    inicial como si se pulsa el bot&oacute;n [ Todas ], el listado resultante estar&aacute;
dividido en dos columnas:<br><br>
<div align="center">
  <center>
  <table border="0" width="64%">
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bandera_esp_gran.gif" width="40" height="28"></td>
      <td width="89%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        listado de t&eacute;rminos en espa&ntilde;ol, en la columna de la izquierda</td>
    </tr>
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bandera_ing_grande.gif" width="40" height="28"></td>
      <td width="89%"><b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        listado de t&eacute;rminos en ingl&eacute;s, en la columna de la derecha</td>
    </tr>
  </table>
  </center>
</div>
    <p>En cada l&iacute;nea del listado aparece el t&eacute;rmino, su
categor&iacute;a gramatical y los botones de modificaci&oacute;n (<img border="0" src="../imagenes/modificar_ico.gif" width="17" height="20">)
    y borrado (<img border="0" src="../imagenes/papelera_ico.png" width="18" height="20">)
    del t&eacute;rmino del glosario.<br><br> 
    Para la <b> operaci&oacute;n de eliminaci&oacute;n</b>, aparece en
    pantalla la ficha del t&eacute;rmino a eliminar y un mensaje de confirmaci&oacute;n de
    la eliminaci&oacute;n. Este mensaje es necesario para eliminar el t&eacute;rmino deseado
    y no otro que haya podido seleccionarse por error. <br><br>
    Para la <b> operaci&oacute;n de modificaci&oacute;n</b>, se muestra un formulario con el idioma, categor&iacute;a
    gramatical, definici&oacute;n, traducci&oacute;n del t&eacute;rmino y listado de contextos que son los &uacute;nicos
    elementos de la ficha modificables. El resto (nombre del t&eacute;rmino,
    ocurrencias y relaciones) son fijos y no admiten modificaci&oacute;n.</p>
  </li>
</ol>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">3.2. Administraci&oacute;n de relaciones entre
t&eacute;rminos del glosario</font></p>
<p>La pantalla de administraci&oacute;n de t&eacute;rminos del glosario est&aacute; dividida en 2
partes: crear una relaci&oacute;n nueva y modificar/eliminar una relaci&oacute;n existente.
Tras rellenar el formulario de <u>una y s&oacute;lo una</u> de estas dos partes, se
pulsa en el bot&oacute;n [ Aceptar ] para confirmar la opci&oacute;n. A continuaci&oacute;n se
describen cada una de las dos opciones:</p>
<ol>
  <li><b>Nueva relaci&oacute;n</b> (parte superior de la pantalla). Se introduce el
    tipo de la relaci&oacute;n (campo <i>Tipo de relaci&oacute;n</i>), el primer t&eacute;rmino
    (campo <i>T&eacute;rmino 1 - principal</i>), el segundo t&eacute;rmino (campo <i>T&eacute;rmino
    2</i>) y, en caso necesario, la preposici&oacute;n espa&ntilde;ola/inglesa (campo <i>Preposici&oacute;n</i>).
    El <b>t&eacute;rmino 1 </b>es imprescindible, y no puede dejarse en blanco; en
    cambio, el t&eacute;rmino 2 puede dejarse en blanco opcionalmente en funci&oacute;n del
    tipo de relaci&oacute;n seleccionada. S&oacute;lo puede seleccionarse una <b>preposici&oacute;n</b>
    espa&ntilde;ola o una preposici&oacute;n inglesa, pero nunca ambas a la vez (en este
    caso el sistema muestra una ventana de aviso por pantalla); tambi&eacute;n pueden
    dejarse ambas en blanco (s&iacute;mbolo &quot;-&quot;). <br>
    <br>A continuaci&oacute;n el
    sistema busca los t&eacute;rminos 1 y 2 en el glosario. Si alguno de los t&eacute;rminos
    no existe o bien la relaci&oacute;n entre ellos ya existe en el glosario, se
    muestra por pantalla un aviso informando de estos hechos.<br><br></li>
  <li><b>Modificar/eliminar relaci&oacute;n</b> (parte inferior de la pantalla).
    Aparece un cuadro de texto en el que hay que escribir uno de los dos
    t&eacute;rminos que forman la relaci&oacute;n. Aparecer&aacute; entonces en pantalla una lista
    de todas las relaciones en las que aparezca dicho t&eacute;rmino. <br><br>
    En cada l&iacute;nea del listado aparecen
    los botones de modificaci&oacute;n (<img border="0" src="../imagenes/modificar_ico.gif" width="17" height="20">)
    y borrado (<img border="0" src="../imagenes/papelera_ico.png" width="18" height="20">)
    de la relaci&oacute;n entre t&eacute;rminos.&nbsp;<br><br> 
    Para la <b> operaci&oacute;n de eliminaci&oacute;n</b>, aparecen en
    pantalla los datos de la relaci&oacute;n (tipo de relaci&oacute;n, t&eacute;rmino 1, t&eacute;rmino
    2 y preposici&oacute;n) y un mensaje de confirmaci&oacute;n de
    la eliminaci&oacute;n. Este mensaje es necesario para eliminar la relaci&oacute;n deseada
    y no otra que haya podido seleccionarse por error. <br><br>
    Para la <b> operaci&oacute;n de
    modificaci&oacute;n</b>, se muestra un formulario con el tipo de relaci&oacute;n, los
    t&eacute;rminos involucrados y la preposici&oacute;n utilizada. Todos los datos son
    modificables; &uacute;nicamente hay que tener en cuenta las <b>excepciones</b>
    contempladas en el apartado de creaci&oacute;n de una nueva relaci&oacute;n: los
    t&eacute;rminos deben existir en el glosario, el t&eacute;rmino 1 no puede dejarse en
    blanco, la relaci&oacute;n no se modificar&aacute; si la nueva ya existe en el glosario,
    y s&oacute;lo puede utilizarse una preposici&oacute;n para la relaci&oacute;n. En todos estos
    casos el sistema mostrar&aacute; por pantalla un aviso informando del suceso
    correspondiente.
  </li>
</ol>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">3.3. Administraci&oacute;n de tipos de relaciones</font></p>
<p>La pantalla de administraci&oacute;n de tipos de relaciones est&aacute; formada por un
listado de todas los tipos de relaciones existentes en el glosario.&nbsp;</p>
<p>En el listado aparecen los siguientes botones:</p>
<div align="center">
  <center>
  <table border="0" width="69%">
    <tr>
      <td width="18%" align="center"><input type="button" class="boton boton_nuevo" value="        Nuevo Tipo de Relaci&oacute;n " onclick=""/></td>
      <td width="82%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        crear un nuevo tipo de relaci&oacute;n entre t&eacute;rminos</td>
    </tr>
    <tr>
      <td width="18%" align="center"><img border="0" src="../imagenes/modificar_ico.gif" width="17" height="20"></td>
      <td width="82%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        modificar un tipo de relaci&oacute;n entre t&eacute;rminos</td>
    </tr>
    <tr>
      <td width="18%" align="center"><img border="0" src="../imagenes/papelera_ico.png" width="18" height="20"></td>
      <td width="82%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        eliminar un tipo de relaci&oacute;n entre t&eacute;rminos</td>
    </tr>
  </table>
  </center>
</div>
<p>La operaci&oacute;n de <b>creaci&oacute;n de un nuevo tipo de relaci&oacute;n</b> entre
t&eacute;rminos se realizar pulsando en bot&oacute;n descrito anteriormente y rellenando el
formulario con los datos de la nueva relaci&oacute;n: el <b>identificador</b> de la
nueva relaci&oacute;n y el <b>tipo de la relaci&oacute;n</b> (este campo es en realidad una
descripci&oacute;n del tipo de relaci&oacute;n). El identificador es &uacute;nico para cada tipo
de relaci&oacute;n, por lo que si se introduce uno ya existente en el glosario, el
sistema mostrar&aacute; un mensaje de aviso por pantalla informando de este hecho.</p>
<p>En la operaci&oacute;n de <b>eliminaci&oacute;n de un tipo de relaci&oacute;n</b> entre
t&eacute;rminos, aparecen en
    pantalla los datos del tipo de relaci&oacute;n (identificador y tipo de la
relaci&oacute;n) y un mensaje de confirmaci&oacute;n de
    la eliminaci&oacute;n. Este mensaje es necesario para eliminar el tipo de
relaci&oacute;n deseada
    y no otro que haya podido seleccionarse por error.</p>
<p>En la operaci&oacute;n de <b>modificaci&oacute;n de un tipo de relaci&oacute;n</b> entre
t&eacute;rminos, se muestra un formulario con el identificador y la descripci&oacute;n del
tipo de relaci&oacute;n. Si se modifica el identificador hay que tener en cuenta que
el nuevo identificador no exista ya en el glosario; si existe, el sistema
muestra un mensaje de aviso por pantalla. Adem&aacute;s, si existe alguna relaci&oacute;n de
este tipo en el glosario, el campo tipo de relaci&oacute;n de dicha relaci&oacute;n se
actualizar&aacute; autom&aacute;ticamente con el nuevo identificador introducido.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5"><b>4. Operaciones de consulta del glosario</b></font></p>
<p><font color="#0000FF" size="5">4.1. </font><font color="#0000FF" size="5">B&uacute;squeda
por inicial</font></p>
<p>En el men&uacute; de la izquierda de la pantalla aparece un cuadro rodeado por una
l&iacute;nea punteada. Dentro de &eacute;l encontramos las letras del alfabeto espa&ntilde;ol, y
justo al final la opci&oacute;n [ Todas ].</p>
<p>Al pinchar en una de las letras, aparece en pantalla un listado con todas las
palabras del glosario que tienen como inicial dicha letra. Dicho listado est&aacute;
dividido en dos columnas:</p>
<div align="center">
  <center>
  <table border="0" width="64%">
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bandera_esp_gran.gif" width="40" height="28"></td>
      <td width="89%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        listado de t&eacute;rminos en espa&ntilde;ol, en la columna de la izquierda</td>
    </tr>
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bandera_ing_grande.gif" width="40" height="28"></td>
      <td width="89%"><b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        listado de t&eacute;rminos en ingl&eacute;s, en la columna de la derecha</td>
    </tr>
  </table>
  </center>
</div>
<p>En cada l&iacute;nea del listado aparece cada t&eacute;rmino (en color rojo) y su
categor&iacute;a gramatical entre par&eacute;ntesis. Para acceder a la <b>ficha</b> de un
t&eacute;rmino de hay que pinchar sobre el t&eacute;rmino, y el sistema mostrar&aacute; la ficha
por pantalla.</p>
<p>Al final de cada lista se muestra un <b>pie</b> en el que se indica el
n&uacute;mero de t&eacute;rminos listados en cada columna.</p>
<p>Si se pincha en la opci&oacute;n <b>[ Todas ]</b> aparece un listado con todos los
t&eacute;rminos del glosario, en ambos idiomas.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">4.2. B&uacute;squeda por t&eacute;rmino</font></p>
<p>En el&nbsp; men&uacute; de la izquierda aparece un cuadro rojo con un cuadro de
texto en su interior. En este cuadro se debe escribir el t&eacute;rmino completo que
se desea buscar en el glosario. A continuaci&oacute;n se pulsa el bot&oacute;n de inicio de
b&uacute;squeda para mostrar la ficha del t&eacute;rmino. Este bot&oacute;n es el siguiente: </p>
<div align="center">
  <center>
  <table border="0" width="64%">
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bot_buscar.gif" width="30" height="24"></td>
      <td width="89%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        Iniciar la b&uacute;squeda del t&eacute;rmino en el glosario</td>
    </tr>
  </table>
  </center>
</div>
<p>Si el t&eacute;rmino se deja en blanco y se pulsa el bot&oacute;n anterior, el sistema
mostrar&aacute; un aviso de error porque el t&eacute;rmino no puede estar vac&iacute;o.</p>
<p>En caso de que el t&eacute;rmino no se encuentre en el glosario, el sistema
mostrar&aacute; por pantalla un aviso informando de este hecho.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5"><b>5. Ficha de un t&eacute;rmino del glosario</b></font></p>
<p>La ficha del t&eacute;rmino contiene toda la informaci&oacute;n asociada a &eacute;ste, que es
la siguiente:</p>
<ul>
  <li><b>idioma</b> del t&eacute;rmino</li>
  <li><b>categor&iacute;a gramatical</b>: puede ser <i>sustantivo</i>, <i>verbo</i>, <i>adjetivo</i>,
    <i>sustantivo/verbo</i>, <i>sustantivo/adjetivo</i>, <i>determinante</i>, <i>pronombre</i>,
    <i>preposici&oacute;n</i>, <i>conjuci&oacute;n</i>, <i>adverbio</i> o<i> interjecci&oacute;n</i></li>
  <li><b>definici&oacute;n</b> del t&eacute;rmino</li>
  <li><b>traducci&oacute;n</b> al idioma opuesto (si el t&eacute;rmino es espa&ntilde;ol, es su
    traducci&oacute;n a ingl&eacute;s, y viceversa)</li>
  <li><b>n&uacute;mero de ocurrencias</b> en los textos del corpus (si el t&eacute;rmino no aparece
    en los textos tendr&aacute; valor nulo)</li>
  <li><b>contextos</b> de aparici&oacute;n del t&eacute;rmino en los textos del corpus (si el
    t&eacute;rmino no aparece en los textos no tendr&aacute; contextos asociados)</li>
  <li><b>relaciones con otros t&eacute;rminos </b> del glosario (si el t&eacute;rmino no tiene
    relaciones con otros t&eacute;rminos del glosario no aparecer&aacute; ninguna relaci&oacute;n
    asociada)</li>
</ul>
<p>A continuaci&oacute;n vamos a detenernos en describir con m&aacute;s detalle la
informaci&oacute;n m&aacute;s importante del glosario: los contextos y las relaciones con
otros t&eacute;rminos.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">5.1. Contextos de un t&eacute;rmino</font></p>
<p>Como su propio nombre indica, el <b> contexto</b> de un t&eacute;rmino es el &aacute;mbito o
conjunto de palabras que rodean a una ocurrencia del t&eacute;rmino en un texto del
corpus. El contexto es en s&iacute; una informaci&oacute;n muy &uacute;til para el usuario de <i>Cal&iacute;ope</i>,
pues muestra c&oacute;mo se utiliza un determinado t&eacute;rmino dentro de un texto.</p>
<p>Debido a la definici&oacute;n de contexto anteriormente escrita, cada t&eacute;rmino del
glosario tendr&aacute; tantos contextos como ocurrencias en los textos del corpus.</p>
<p>Los contextos se muestran en un listado. Veamos un ejemplo de un contexto
para la palabra &quot;aplicaciones&quot;:</p>

<table align="center" border="0" width="90%" cellspacing="5">
<tr><td align="center">Ciberpais</td><td>
<p class="Definicion">... que mejoran el rendimiento de &eacute;stas.
Esta evoluci&oacute;n en la comunicaci&oacute;n se rige por medio de infraestructuras aplicadas con servicios 
convergentes y <u>aplicaciones</u> integradas. La convergencia de la informaci&oacute;n y la 
comunicaci&oacute;n es una tendencia importante que est&aacute; influenciando tanto al mercado actual 
como al futuro, a ...</p></td></tr>
</table>
<p>Como observamos, el contexto aparece en un cuadro con fondo azul y borde
punteado. A la izquierda del cuadro aparece entre corchetes el nombre del
texto del cual se ha extra&iacute;do el contexto. La palabra clave
&quot;aplicaciones&quot; aparece subrayada para una mejor identificaci&oacute;n dentro
del contexto.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">5.2. Relaciones de un t&eacute;rmino con otros
t&eacute;rminos del glosario</font></p>
<p>A la hora de traducir un texto, muchas veces es importante saber qu&eacute;
t&eacute;rminos suelen ir acompa&ntilde;ados de otros t&eacute;rminos, y el tipo de relaci&oacute;n que
los une. Esta informaci&oacute;n tambi&eacute;n es recogida por <i>Cal&iacute;ope</i>.</p>
<p>Los tipos de relaciones pueden ser definidas por el administrador del
sistema; para los usuarios que s&oacute;lo pueden realizar consultas, pueden verlas en
la ficha de cada t&eacute;rmino.</p>
<p>Las relaciones se definen &uacute;nicamente entre 2 elementos. En algunas
ocasiones, las relaciones vienen definidas con una preposici&oacute;n entre los
t&eacute;rminos, pues es necesaria para su significado. Veamos dos ejemplos para el
t&eacute;rmino &quot;usuario&quot;:</p>

<table align="center" border="0" width="90%" cellspacing="5">
<tr>
<td align="center" bgcolor="#FFCC66" width="200">[ agente ]</td>
<td align="center" bgcolor="#FFCC66">
{ usuario - <a href="">conectar</a> }, 
{ usuario - <a href="">descargar</a> }</td>
</tr>
<tr>
<td align="center" bgcolor="#FFCC66" width="200">[ comp_indir ]</td>
<td align="center" bgcolor="#FFCC66">
{ <a href="">communicar</a> - <i>a</i> - usuario }</td>
</tr>
</table>

<p>En el ejemplo vemos dos tipos de relaciones: la relaci&oacute;n <i>agente</i> y la
relaci&oacute;n <i>comp_indir</i>. Para la relaci&oacute;n <i>agente</i> observamos que
existen dos t&eacute;rminos con los que <i>usuario</i> tiene este tipo de relaci&oacute;n: <i>conectar</i>
y <i>descargar</i>; se puede pinchar sobre cada uno de estos t&eacute;rminos para
acceder de forma r&aacute;pida a sus respectivas fichas. <br>
Para la relaci&oacute;n <i>comp_indir</i>, vemos que ha sido necesario insertar la
preposici&oacute;n <i>a</i> entre los dos t&eacute;rminos. Al igual que para cualquier
relaci&oacute;n, el t&eacute;rmino (<i>comunicar</i>) con el cual se relaciona el t&eacute;rmino
de la ficha (<i>usuario</i>) forma un enlace a su propia ficha (ficha de <i>comunicar</i>). </p>
</body>

</html>
