<!-- 
   ayuda_principal.htm
   ------------------------------------------------------------------------------------------------
   P&aacute;gina de inicio. Se realiza la autenticaci&oacute;n.

   Copyright (c) 10-03-2006 Ra&uacute;l BARAHONA CRESPO (raulbcneo@terra.es)
     Verbatim copying and distribution of this entire document is permitted in 
     any medium, provided this notice is preserved. 
-->

<html>
<head><title></title>
   <link rel="stylesheet" type="text/css" href="../comun/estilo.css">
   <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
   <meta content="Microsoft FrontPage 4.0" name=GENERATOR>
</head>

<body background="../imagenes/logocaliope3_fondo.gif" bgproperties="fixed" >

<table border="0" width="100%" bgcolor="#009900">
  <tr>
    <td width="270"><font color="#FFFFFF" size="6">&nbsp;Ayuda de </font><i><font color="#33CC33" size="6">Cal&iacute;ope</font></i></td>
    <td style="border: 1 solid #FFFFFF">
      <p align="center"><font color="#FFFFFF" size="6">Glosario</font></p>
    </td>
    <td width="100">
      <p align="right"><font color="#33CC33" size="1"><b>&uacute;ltima actualizaci&oacute;n:</b> <br>21 de septiembre de 2010</font></td>
  </tr>
</table>
<p align="center">&nbsp;</p>

<p><font color="#0000FF" size="5"><b>1. ¿Qu&eacute; es el glosario?</b></font></p>

El glosario es una lista o conjunto de t&eacute;rminos inform&aacute;ticos a los cuales se
ha asociado determinada informaci&oacute;n que ser&aacute; detallada en sucesivos apartados.
El glosario est&aacute; &iacute;ntimamente relacionado con el
corpus textual. Adem&aacute;s, cada t&eacute;rmino del glosario tiene asociada una <b>ficha</b> en la que se muestran todos los datos vinculados
al t&eacute;rmino.
<p>&nbsp;</p>
<p><font color="#0000FF" size="5"><b>2. Men&uacute; del glosario y operaciones</b></font></p>
<p>En la parte izquierda de la pantalla aparecen todas las opciones disponibles
para la b&uacute;squeda de un t&eacute;rmino del glosario: b&uacute;squeda por inicial y b&uacute;squeda
por t&eacute;rmino completo.</p>
<p>En parte derecha de la pantalla se mostrar&aacute;n los resultados de la b&uacute;squeda
de un t&eacute;rmino del glosario.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">2.1. </font><font color="#0000FF" size="5">B&uacute;squeda
por inicial</font></p>
<p>En el men&uacute; de la izquierda de la pantalla aparece un cuadro rodeado por una
l&iacute;nea punteada. Dentro de &eacute;l encontramos las letras del alfabeto espa&ntilde;ol, y
justo al final la opci&oacute;n [ Todas ].</p>
<p>Al pinchar en una de las letras, aparece en pantalla un listado con todas las
palabras del glosario que tienen como inicial dicha letra. Dicho listado est&aacute;
dividido en dos columnas:</p>
<div align="center">
  <center>
  <table border="0" width="64%">
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bandera_esp_gran.gif" width="40" height="28"></td>
      <td width="89%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        listado de t&eacute;rminos en espa&ntilde;ol, en la columna de la izquierda</td>
    </tr>
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bandera_ing_grande.gif" width="40" height="28"></td>
      <td width="89%"><b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        listado de t&eacute;rminos en ingl&eacute;s, en la columna de la derecha</td>
    </tr>
  </table>
  </center>
</div>
<p>En cada l&iacute;nea del listado aparece cada t&eacute;rmino (en color rojo) y su
categor&iacute;a gramatical entre par&eacute;ntesis. Para acceder a la <b>ficha</b> de un
t&eacute;rmino de hay que pinchar sobre el t&eacute;rmino, y el sistema mostrar&aacute; la ficha
por pantalla.</p>
<p>Al final de cada lista se muestra un <b>pie</b> en el que se indica el
n&uacute;mero de t&eacute;rminos listados en cada columna.</p>
<p>Si se pincha en la opci&oacute;n <b>[ Todas ]</b> aparece un listado con todos los
t&eacute;rminos del glosario, en ambos idiomas.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">2.2. B&uacute;squeda por t&eacute;rmino</font></p>
<p>En el&nbsp; men&uacute; de la izquierda aparece un cuadro rojo con un cuadro de
texto en su interior. En este cuadro se debe escribir el t&eacute;rmino completo que
se desea buscar en el glosario. A continuaci&oacute;n se pulsa el bot&oacute;n de inicio de
b&uacute;squeda para mostrar la ficha del t&eacute;rmino. Este bot&oacute;n es el siguiente: </p>
<div align="center">
  <center>
  <table border="0" width="64%">
    <tr>
      <td width="11%" align="center"><img border="0" src="../imagenes/bot_buscar.gif" width="30" height="24"></td>
      <td width="89%">&nbsp;<b><span style="mso-char-type: symbol; mso-symbol-font-family: Symbol; mso-ascii-font-family: Times New Roman; mso-fareast-font-family: Times New Roman; mso-hansi-font-family: Times New Roman; mso-bidi-font-family: Times New Roman; mso-ansi-language: ES; mso-fareast-language: ES; mso-bidi-language: AR-SA"><font face="Symbol" size="4">®</font></span></b>
        Iniciar la b&uacute;squeda del t&eacute;rmino en el glosario</td>
    </tr>
  </table>
  </center>
</div>
<p>Si el t&eacute;rmino se deja en blanco y se pulsa el bot&oacute;n anterior, el sistema
mostrar&aacute; un aviso de error porque el t&eacute;rmino no puede estar vac&iacute;o.</p>
<p>En caso de que el t&eacute;rmino no se encuentre en el glosario, el sistema
mostrar&aacute; por pantalla un aviso informando de este hecho.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5"><b>3. Ficha de un t&eacute;rmino del glosario</b></font></p>
<p>La ficha del t&eacute;rmino contiene toda la informaci&oacute;n asociada a &eacute;ste, que es
la siguiente:</p>
<ul>
  <li><b>idioma</b> del t&eacute;rmino</li>
  <li><b>categor&iacute;a gramatical</b>: puede ser <i>sustantivo</i>, <i>verbo</i>, <i>adjetivo</i>,
    <i>sustantivo/verbo</i>, <i>sustantivo/adjetivo</i>, <i>determinante</i>, <i>pronombre</i>,
    <i>preposici&oacute;n</i>, <i>conjuci&oacute;n</i>, <i>adverbio</i> o<i> interjecci&oacute;n</i></li>
  <li><b>definici&oacute;n</b> del t&eacute;rmino</li>
  <li><b>traducci&oacute;n</b> al idioma opuesto (si el t&eacute;rmino es espa&ntilde;ol, es su
    traducci&oacute;n a ingl&eacute;s, y viceversa)</li>
  <li><b>n&uacute;mero de ocurrencias</b> en los textos del corpus (si el t&eacute;rmino no aparece
    en los textos tendr&aacute; valor nulo)</li>
  <li><b>contextos</b> de aparici&oacute;n del t&eacute;rmino en los textos del corpus (si el
    t&eacute;rmino no aparece en los textos no tendr&aacute; contextos asociados)</li>
  <li><b>relaciones con otros t&eacute;rminos </b> del glosario (si el t&eacute;rmino no tiene
    relaciones con otros t&eacute;rminos del glosario no aparecer&aacute; ninguna relaci&oacute;n
    asociada)</li>
</ul>
<p>A continuaci&oacute;n vamos a detenernos en describir con m&aacute;s detalle la
informaci&oacute;n m&aacute;s importante del glosario: los contextos y las relaciones con
otros t&eacute;rminos.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">3.1. Contextos de un t&eacute;rmino</font></p>
<p>Como su propio nombre indica, el <b> contexto</b> de un t&eacute;rmino es el &aacute;mbito o
conjunto de palabras que rodean a una ocurrencia del t&eacute;rmino en un texto del
corpus. El contexto es en s&iacute; una informaci&oacute;n muy &uacute;til para el usuario de <i>Cal&iacute;ope</i>,
pues muestra c&oacute;mo se utiliza un determinado t&eacute;rmino dentro de un texto.</p>
<p>Debido a la definici&oacute;n de contexto anteriormente escrita, cada t&eacute;rmino del
glosario tendr&aacute; tantos contextos como ocurrencias en los textos del corpus.</p>
<p>Los contextos se muestran en un listado. Veamos un ejemplo de un contexto
para la palabra &quot;aplicaciones&quot;:</p>

<table align="center" border="0" width="90%" cellspacing="5">
<tr><td align="center">Ciberpais</td><td>
<p class="Definicion">... que mejoran el rendimiento de &eacute;stas.
Esta evoluci&oacute;n en la comunicaci&oacute;n se rige por medio de infraestructuras aplicadas con servicios 
convergentes y <u>aplicaciones</u> integradas. La convergencia de la informaci&oacute;n y la 
comunicaci&oacute;n es una tendencia importante que est&aacute; influenciando tanto al mercado actual 
como al futuro, a ...</p></td></tr>
</table>
<p>Como observamos, el contexto aparece en un cuadro con fondo azul y borde
punteado. A la izquierda del cuadro aparece entre corchetes el nombre del
texto del cual se ha extra&iacute;do el contexto. La palabra clave
&quot;aplicaciones&quot; aparece subrayada para una mejor identificaci&oacute;n dentro
del contexto.</p>
<p>&nbsp;</p>
<p><font color="#0000FF" size="5">3.2. Relaciones de un t&eacute;rmino con otros
t&eacute;rminos del glosario</font></p>
<p>A la hora de traducir un texto, muchas veces es importante saber qu&eacute;
t&eacute;rminos suelen ir acompa&ntilde;ados de otros t&eacute;rminos, y el tipo de relaci&oacute;n que
los une. Esta informaci&oacute;n tambi&eacute;n es recogida por <i>Cal&iacute;ope</i>.</p>
<p>Los tipos de relaciones pueden ser definidas por el administrador del
sistema; para los usuarios que s&oacute;lo pueden realizar consultas, pueden verlas en
la ficha de cada t&eacute;rmino.</p>
<p>Las relaciones se definen &uacute;nicamente entre 2 elementos. En algunas
ocasiones, las relaciones vienen definidas con una preposici&oacute;n entre los
t&eacute;rminos, pues es necesaria para su significado. Veamos dos ejemplos para el
t&eacute;rmino &quot;usuario&quot;:</p>

<table align="center" border="0" width="90%" cellspacing="5">
<tr>
<td align="center" bgcolor="#FFCC66" width="200">[ agente ]</td>
<td align="center" bgcolor="#FFCC66">
{ usuario - <a href="">conectar</a> }, 
{ usuario - <a href="">descargar</a> }</td>
</tr>
<tr>
<td align="center" bgcolor="#FFCC66" width="200">[ comp_indir ]</td>
<td align="center" bgcolor="#FFCC66">
{ <a href="">communicar</a> - <i>a</i> - usuario }</td>
</tr>
</table>

<p>En el ejemplo vemos dos tipos de relaciones: la relaci&oacute;n <i>agente</i> y la
relaci&oacute;n <i>comp_indir</i>. Para la relaci&oacute;n <i>agente</i> observamos que
existen dos t&eacute;rminos con los que <i>usuario</i> tiene este tipo de relaci&oacute;n: <i>conectar</i>
y <i>descargar</i>; se puede pinchar sobre cada uno de estos t&eacute;rminos para
acceder de forma r&aacute;pida a sus respectivas fichas. <br>
Para la relaci&oacute;n <i>comp_indir</i>, vemos que ha sido necesario insertar la
preposici&oacute;n <i>a</i> entre los dos t&eacute;rminos. Al igual que para cualquier
relaci&oacute;n, el t&eacute;rmino (<i>comunicar</i>) con el cual se relaciona el t&eacute;rmino
de la ficha (<i>usuario</i>) forma un enlace a su propia ficha (ficha de <i>comunicar</i>). </p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>

</html>
